Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.Beam,Tekla.Structures.Geometry3d.Point)
Splits the beam and creates a new one in the given position.
Object: The beam object to be splitted.
SplitPoint: The position where splitting is executed.
Returns: The created beam on success, null on failure.